app/views/posts/index.html.erb

        <td>
        	<%= post.likes.count %> <%= (post.likes.count) == 1 ? 'Like' : 'Likes'%>
---
SELECT "likes".* FROM "likes" WHERE "likes"."post_id" = ?  [["post_id", 1]]
SELECT COUNT(*) FROM "likes" WHERE "likes"."post_id" = ?  [["post_id", 1]]

        <td>
        	<%= post.comments.count %> <%= (post.comments.count) == 1 ? 'Comment' : 'Commentes'%>
---
SELECT COUNT(*) FROM "comments" WHERE "comments"."post_id" = ?  [["post_id", 1]]