app/controllers/categories_controller.rb

INSERT INTO "categories" ("name", "description", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["name", "секноды"], ["description", "Секондхенды в Москве"], ["created_at", "2022-03-30 13:26:02.621670"], ["updated_at", "2022-03-30 13:26:02.621670"]]
---
  def create
    @category = Category.new(category_params)

    respond_to do |format|
      if @category.save

SELECT "categories".* FROM "categories" WHERE "categories"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
    def set_category
      @category = Category.find(params[:id])