app/controllers/likes_controller.rb

  def already_liked?
    Like.where(user_id: current_user.id, post_id:
    params[:post_id]).exists?
---
SELECT 1 AS one FROM "likes" WHERE "likes"."user_id" = ? AND "likes"."post_id" = ? LIMIT ?  [["user_id", 1], ["post_id", 1], ["LIMIT", 1]]